### Terraform Plan 📦
```
[command]/home/runner/work/_temp/91919427-0465-48f1-99a9-b31f3a1384df/terraform-bin plan -no-color -var-file=dev.tfvars
Acquiring state lock. This may take a few moments...
aws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:903636036611:certificate/47277981-d006-4fd9-9389-36ae7905ed42]
data.aws_route53_zone.route53_existing_zone: Reading...
aws_s3_bucket.s3_terraform_statefile: Refreshing state... [id=terraform-statefile-20251021]
aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E19903IBB66DDO]
module.static_site_bucket.aws_s3_bucket.static_site: Refreshing state... [id=terraform-staticsite-20251021]
aws_dynamodb_table.tf_rock: Refreshing state... [id=Terraform_LockTable_20251021]
data.aws_route53_zone.route53_existing_zone: Read complete after 0s [id=Z087900818DA70F3QYIWE]
aws_route53_record.cert_validation["0"]: Refreshing state... [id=Z087900818DA70F3QYIWE__44a821ee8e7286b9b84d6daee528a1a7.development.fieldwork48.com._CNAME]
aws_acm_certificate_validation.cert_validation: Refreshing state... [id=2025-11-03 05:54:16.941 +0000 UTC]
aws_s3_bucket_versioning.s3_terraform_statefile_versioning: Refreshing state... [id=terraform-statefile-20251021]
module.static_site_bucket.aws_s3_bucket_public_access_block.static_site: Refreshing state... [id=terraform-staticsite-20251021]
module.static_site_bucket.aws_s3_bucket_website_configuration.static_site_config: Refreshing state... [id=terraform-staticsite-20251021]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3PAZUZDPNT35E]
aws_route53_record.cloudfront_alias: Refreshing state... [id=Z087900818DA70F3QYIWE_dev.static.fieldwork48.com_A]
module.static_site_bucket.aws_s3_bucket_policy.static_site_policy: Refreshing state... [id=terraform-staticsite-20251021]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.s3_put_only will be created
  + resource "aws_iam_policy" "s3_put_only" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "apply-log-s3-put-only"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::terraform-apply-logs/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.apply_log_writer will be created
  + resource "aws_iam_role" "apply_log_writer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cloudrobo48/spa:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::903636036611:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-apply-log-writer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_s3_put will be created
  + resource "aws_iam_role_policy_attachment" "attach_s3_put" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "github-apply-log-writer"
    }

  # module.apply_log_bucket.aws_s3_bucket.apply_log_b will be created
  + resource "aws_s3_bucket" "apply_log_b" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-apply-logs-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Project"     = "terrademo1"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Project"     = "terrademo1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.apply_log_bucket.aws_s3_bucket_lifecycle_configuration.log_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "log_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-northeast-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-logs"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Aaws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:903636036611:certificate/47277981-d006-4fd9-9389-36ae7905ed42]%0Adata.aws_route53_zone.route53_existing_zone: Reading...%0Aaws_s3_bucket.s3_terraform_statefile: Refreshing state... [id=terraform-statefile-20251021]%0Aaws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E19903IBB66DDO]%0Amodule.static_site_bucket.aws_s3_bucket.static_site: Refreshing state... [id=terraform-staticsite-20251021]%0Aaws_dynamodb_table.tf_rock: Refreshing state... [id=Terraform_LockTable_20251021]%0Adata.aws_route53_zone.route53_existing_zone: Read complete after 0s [id=Z087900818DA70F3QYIWE]%0Aaws_route53_record.cert_validation["0"]: Refreshing state... [id=Z087900818DA70F3QYIWE__44a821ee8e7286b9b84d6daee528a1a7.development.fieldwork48.com._CNAME]%0Aaws_acm_certificate_validation.cert_validation: Refreshing state... [id=2025-11-03 05:54:16.941 +0000 UTC]%0Aaws_s3_bucket_versioning.s3_terraform_statefile_versioning: Refreshing state... [id=terraform-statefile-20251021]%0Amodule.static_site_bucket.aws_s3_bucket_public_access_block.static_site: Refreshing state... [id=terraform-staticsite-20251021]%0Amodule.static_site_bucket.aws_s3_bucket_website_configuration.static_site_config: Refreshing state... [id=terraform-staticsite-20251021]%0Aaws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3PAZUZDPNT35E]%0Aaws_route53_record.cloudfront_alias: Refreshing state... [id=Z087900818DA70F3QYIWE_dev.static.fieldwork48.com_A]%0Amodule.static_site_bucket.aws_s3_bucket_policy.static_site_policy: Refreshing state... [id=terraform-staticsite-20251021]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_policy.s3_put_only will be created%0A  + resource "aws_iam_policy" "s3_put_only" {%0A      + arn              = (known after apply)%0A      + attachment_count = (known after apply)%0A      + id               = (known after apply)%0A      + name             = "apply-log-s3-put-only"%0A      + name_prefix      = (known after apply)%0A      + path             = "/"%0A      + policy           = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::terraform-apply-logs/*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id        = (known after apply)%0A      + tags_all         = (known after apply)%0A    }%0A%0A  # aws_iam_role.apply_log_writer will be created%0A  + resource "aws_iam_role" "apply_log_writer" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:cloudrobo48/spa:ref:refs/heads/main"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::903636036611:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "github-apply-log-writer"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.attach_s3_put will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_s3_put" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "github-apply-log-writer"%0A    }%0A%0A  # module.apply_log_bucket.aws_s3_bucket.apply_log_b will be created%0A  + resource "aws_s3_bucket" "apply_log_b" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "my-apply-logs-dev"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "ap-northeast-1"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "dev"%0A          + "Project"     = "terrademo1"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "dev"%0A          + "Project"     = "terrademo1"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # module.apply_log_bucket.aws_s3_bucket_lifecycle_configuration.log_lifecycle will be created%0A  + resource "aws_s3_bucket_lifecycle_configuration" "log_lifecycle" {%0A      + bucket                                 = (known after apply)%0A      + expected_bucket_owner                  = (known after apply)%0A      + id                                     = (known after apply)%0A      + region                                 = "ap-northeast-1"%0A      + transition_default_minimum_object_size = "all_storage_classes_128K"%0A%0A      + rule {%0A          + id     = "expire-logs"%0A          + status = "Enabled"%0A            # (1 unchanged attribute hidden)%0A%0A          + expiration {%0A              + days                         = 30%0A              + expired_object_delete_marker = false%0A            }%0A        }%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0

```